first_routes/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def index
    # artworks = Artwork.all
    # render json: artworks
    user = User.find(params[:user_id])