first_routes/app/controllers/artwork_shares_controller.rb

  def create
    artwork_share = ArtworkShare.new(aws_params)

    if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 10], ["created_at", "2018-06-11 20:52:29.358846"], ["updated_at", "2018-06-11 20:52:29.358846"]]

  def destroy
    artwork_share = ArtworkShare.find(params[:id])

    render json: artwork_share.artwork
    artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]